app/views/questions/show.html.erb

SELECT "choices".* FROM "choices" INNER JOIN "choices_questions" ON "choices"."id" = "choices_questions"."choice_id" WHERE "choices_questions"."question_id" = ?  [["question_id", 3]]
---
  <div class="col-lg-1 col-md-1 col-sm-1"></div>
  <% @question.choices.each do |choice| %>