app/views/users/show.html.erb


<h3>You've made <%= pluralize(@comments.size,'comment') %>.</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 4]]