app/views/answers/show.html.erb

  <div class="col-lg-1 col-md-1 col-sm-1"></div>
  <% @question.choices.each do |choice| %>
---
SELECT  "choices".* FROM "choices" INNER JOIN "choices_questions" ON "choices"."id" = "choices_questions"."choice_id" WHERE "choices_questions"."question_id" = ? ORDER BY "choices"."id" DESC LIMIT ?  [["question_id", 2], ["LIMIT", 1]]