app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    answer = Answer.find_by(id: params[:id])

INSERT INTO "answers" ("user_id", "question_id", "choice_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["question_id", 8], ["choice_id", 3], ["created_at", "2018-02-12 21:32:32.678112"], ["updated_at", "2018-02-12 21:32:32.678112"]]
---
  def create
    @answer = Answer.create(answer_params)