app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
      answer = @comment.user.answers.last
---
INSERT INTO "comments" ("user_id", "question_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["question_id", 9], ["content", "I love swords!"], ["created_at", "2018-02-13 18:40:56.682769"], ["updated_at", "2018-02-13 18:40:56.682769"]]
SELECT  "answers".* FROM "answers" WHERE "answers"."user_id" = ? ORDER BY "answers"."id" DESC LIMIT ?  [["user_id", 4], ["LIMIT", 1]]