app/controllers/questions_controller.rb

  def show
    @question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]