app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "zip_code", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "zip_code" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["zip_code", 11732], ["updated_at", "2018-02-12 19:56:38.871955"], ["id", 1]]
---
  def update
    if current_user.update(user_params)